chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D42.xml
        <register>
          <name>CONF_ARBITER</name>
          <description>MPDDRC Configuration Arbiter Register</description>
          <addressOffset>0x00000044</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ARB</name>
              <description>Type of Arbitration</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ROUND</name>
                  <description>Round Robin</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NB_REQUEST</name>
                  <description>Request Policy</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BANDWIDTH</name>
                  <description>Bandwidth Policy</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BDW_MAX_CUR</name>
              <description>Bandwidth Max or Current</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P0</name>
              <description>Request or Word from Port X</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P1</name>
              <description>Request or Word from Port X</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P2</name>
              <description>Request or Word from Port X</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P3</name>
              <description>Request or Word from Port X</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P4</name>
              <description>Request or Word from Port X</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P5</name>
              <description>Request or Word from Port X</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P6</name>
              <description>Request or Word from Port X</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RQ_WD_P7</name>
              <description>Request or Word from Port X</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P0</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P1</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P2</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P3</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P4</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P5</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P6</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MA_PR_P7</name>
              <description>Master or Software Provide Information</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P0</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P1</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P2</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P3</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P4</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P5</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P6</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BDW_BURST_P7</name>
              <description>Bandwidth is Reached or Bandwidth and Current Burst Access is Ended on port X</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TIMEOUT</name>
          <description>MPDDRC Timeout Register</description>
          <addressOffset>0x00000048</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>TIMEOUT_P0</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT_P1</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT_P2</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT_P3</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT_P4</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT_P5</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT_P6</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TIMEOUT_P7</name>
              <description>Timeout for Ports 0, 1, 2, 3, 4, 5, 6 and 7</description>
              <bitOffset>28</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REQ_PORT_0123</name>
          <description>MPDDRC Request Port 0-1-2-3 Register</description>
          <addressOffset>0x0000004C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NRQ_NWD_BDW_P0</name>
              <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRQ_NWD_BDW_P1</name>
              <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRQ_NWD_BDW_P2</name>
              <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRQ_NWD_BDW_P3</name>
              <description>Number of Requests, Number of Words or Bandwidth Allocation from Port 0-1-2-3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REQ_PORT_4567</name>
          <description>MPDDRC Request Port 4-5-6-7 Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>NRQ_NWD_BDW_P4</name>
              <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRQ_NWD_BDW_P5</name>
              <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRQ_NWD_BDW_P6</name>
              <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>NRQ_NWD_BDW_P7</name>
              <description>Number of Requests, Number of Words or Bandwidth allocation from port 4-5-6-7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BDW_PORT_0123</name>
          <description>MPDDRC Current/Maximum Bandwidth Port 0-1-2-3 Register</description>
          <addressOffset>0x00000054</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BDW_P0</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDW_P1</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDW_P2</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDW_P3</name>
              <description>Current/Maximum Bandwidth from Port 0-1-2-3</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>BDW_PORT_4567</name>
          <description>MPDDRC Current/Maximum Bandwidth Port 4-5-6-7 Register</description>
          <addressOffset>0x00000058</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>BDW_P4</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitOffset>0</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDW_P5</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitOffset>8</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDW_P6</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BDW_P7</name>
              <description>Current/Maximum Bandwidth from Port 4-5-6-7</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RD_DATA_PATH</name>
          <description>MPDDRC Read Data Path Register</description>
          <addressOffset>0x0000005C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SHIFT_SAMPLING</name>
              <description>Shift Sampling Point of Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NO_SHIFT</name>
                  <description>Initial sampling point.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT_ONE_CYCLE</name>
                  <description>Sampling point is shifted by one cycle.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT_TWO_CYCLES</name>
                  <description>Sampling point is shifted by two cycles.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SHIFT_THREE_CYCLES</name>
                  <description>Sampling point is shifted by three cycles, unique for LPDDR2.Not applicable for DDR2 and LPDDR1 devices.</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPMR</name>
          <description>MPDDRC Write Protection Mode Register</description>
          <addressOffset>0x000000E4</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPEN</name>
              <description>Write Protection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WPKEY</name>
              <description>Write Protection Key</description>
              <bitOffset>8</bitOffset>
              <bitWidth>24</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                  <value>0x444452</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>WPSR</name>
          <description>MPDDRC Write Protection Status Register</description>
          <addressOffset>0x000000E8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>WPVS</name>
              <description>Write Protection Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WPVSRC</name>
              <description>Write Protection Violation Source</description>
              <bitOffset>8</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_OS</name>
          <description>MPDDRC DLL Offset Selection Register</description>
          <addressOffset>0x00000100</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>SELOFF</name>
              <description>Offset Selection</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_MAO</name>
          <description>MPDDRC DLL Master Offset Register</description>
          <addressOffset>0x00000104</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>MAOFF</name>
              <description>Master Delay Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DLL_SO0</name>
          <description>MPDDRC DLL Slave Offset 0 Register</description>
          <addressOffset>0x00000108</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>S0OFF</name>
              <description>SLAVEx Delay Line Offset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S1OFF</name>
              <description>SLAVEx Delay Line Offset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S2OFF</name>
              <description>SLAVEx Delay Line Offset</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>S3OFF</name>
              <description>SLAVEx Delay Line Offset</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
