chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D42.xml
        <register>
          <name>EPTCTL11</name>
          <description>UDPHS Endpoint Control Register (endpoint = 11)</description>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EPT_ENABL</name>
              <description>Endpoint Enable (cleared upon USB reset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTO_VALID</name>
              <description>Packet Auto-Valid Enabled (Not for CONTROL Endpoints) (cleared upon USB reset)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTDIS_DMA</name>
              <description>Interrupt Disables DMA (cleared upon USB reset)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NYET_DIS</name>
              <description>NYET Disable (Only for High Speed Bulk OUT Endpoints) (cleared upon USB reset)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_OVFLW</name>
              <description>Overflow Error Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>TX Packet Ready Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_SETUP</name>
              <description>Received SETUP Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALL_SNT</name>
              <description>Stall Sent Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAK_IN</name>
              <description>NAKIN Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAK_OUT</name>
              <description>NAKOUT Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY_BANK</name>
              <description>Busy Bank Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHRT_PCKT</name>
              <description>Short Packet Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTCTL11_ISOENDPT</name>
          <description>UDPHS Endpoint Control Register (endpoint = 11)</description>
          <alternateGroup>ISOENDPT</alternateGroup>
          <addressOffset>0x0000026C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>EPT_ENABL</name>
              <description>Endpoint Enable (cleared upon USB reset)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AUTO_VALID</name>
              <description>Packet Auto-Valid Enabled (cleared upon USB reset)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>INTDIS_DMA</name>
              <description>Interrupt Disables DMA (cleared upon USB reset)</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>DATAX_RX</name>
              <description>DATAx Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>MDATA_RX</name>
              <description>MDATA Interrupt Enabled (Only for High Bandwidth Isochronous OUT endpoints) (cleared upon USB reset)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_OVFLW</name>
              <description>Overflow Error Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRDY_TRER</name>
              <description>TX Packet Ready/Transaction Error Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_FL_ISO</name>
              <description>Error Flow Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_CRC_NTR</name>
              <description>ISO CRC Error/Number of Transaction Error Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ERR_FLUSH</name>
              <description>Bank Flush Error Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY_BANK</name>
              <description>Busy Bank Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHRT_PCKT</name>
              <description>Short Packet Interrupt Enabled (cleared upon USB reset)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTSETSTA11</name>
          <description>UDPHS Endpoint Set Status Register (endpoint = 11)</description>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRCESTALL</name>
              <description>Stall Handshake Request Set</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>KILL Bank Set (for IN Endpoint)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>TX Packet Ready Set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTSETSTA11_ISOENDPT</name>
          <description>UDPHS Endpoint Set Status Register (endpoint = 11)</description>
          <alternateGroup>ISOENDPT</alternateGroup>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>RXRDY_TXKL</name>
              <description>KILL Bank Set (for IN Endpoint)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TXRDY_TRER</name>
              <description>TX Packet Ready Set</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTCLRSTA11</name>
          <description>UDPHS Endpoint Clear Status Register (endpoint = 11)</description>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>FRCESTALL</name>
              <description>Stall Handshake Request Clear</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TOGGLESQ</name>
              <description>Data Toggle Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RX_SETUP</name>
              <description>Received SETUP Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>STALL_SNT</name>
              <description>Stall Sent Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAK_IN</name>
              <description>NAKIN Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>NAK_OUT</name>
              <description>NAKOUT Clear</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTCLRSTA11_ISOENDPT</name>
          <description>UDPHS Endpoint Clear Status Register (endpoint = 11)</description>
          <alternateGroup>ISOENDPT</alternateGroup>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>TOGGLESQ</name>
              <description>Data Toggle Clear</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data Clear</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete Clear</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_FL_ISO</name>
              <description>Error Flow Clear</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_CRC_NTR</name>
              <description>Number of Transaction Error Clear</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>ERR_FLUSH</name>
              <description>Bank Flush Error Clear</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>EPTSTA11</name>
          <description>UDPHS Endpoint Status Register (endpoint = 11)</description>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <fields>
            <field>
              <name>FRCESTALL</name>
              <description>Stall Handshake Request (cleared upon USB reset)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TOGGLESQ_STA</name>
              <description>Toggle Sequencing (cleared upon USB reset)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DATA0</name>
                  <description>DATA0</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA1</name>
                  <description>DATA1</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>DATA2</name>
                  <description>Reserved for High Bandwidth Isochronous Endpoint</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MDATA</name>
                  <description>Reserved for High Bandwidth Isochronous Endpoint</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ERR_OVFLW</name>
              <description>Overflow Error (cleared upon USB reset)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RXRDY_TXKL</name>
              <description>Received OUT Data/KILL Bank (cleared upon USB reset)</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TX_COMPLT</name>
              <description>Transmitted IN Data Complete (cleared upon USB reset)</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TXRDY</name>
              <description>TX Packet Ready (cleared upon USB reset)</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>RX_SETUP</name>
              <description>Received SETUP (cleared upon USB reset)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>STALL_SNT</name>
              <description>Stall Sent (cleared upon USB reset)</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAK_IN</name>
              <description>NAK IN (cleared upon USB reset)</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>NAK_OUT</name>
              <description>NAK OUT (cleared upon USB reset)</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>CURBK_CTLDIR</name>
              <description>Current Bank/Control Direction (cleared upon USB reset)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>BUSY_BANK_STA</name>
              <description>Busy Bank Number (cleared upon USB reset)</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>0BUSYBANK</name>
                  <description>All banks are free</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1BUSYBANK</name>
                  <description>1 busy bank</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>2BUSYBANKS</name>
                  <description>2 busy banks</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>3BUSYBANKS</name>
                  <description>3 busy banks</description>
                  <value>0x3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYTE_COUNT</name>
              <description>UDPHS Byte Count (cleared upon USB reset)</description>
              <bitOffset>20</bitOffset>
              <bitWidth>11</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SHRT_PCKT</name>
              <description>Short Packet (cleared upon USB reset)</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
