chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D42.xml
      </registers>
    </peripheral>
    <peripheral>
      <name>AES</name>
      <version>6149Y</version>
      <description>Advanced Encryption Standard</description>
      <prependToName>AES_</prependToName>
      <baseAddress>0xFC044000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>AES</name>
        <value>12</value>
      </interrupt>
      <registers>
        <register>
          <name>CR</name>
          <description>Control Register</description>
          <addressOffset>0x00000000</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>START</name>
              <description>Start Processing</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>SWRST</name>
              <description>Software Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MR</name>
          <description>Mode Register</description>
          <addressOffset>0x00000004</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>CIPHER</name>
              <description>Processing Mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>GTAGEN</name>
              <description>GCM Automatic Tag Generation Enable</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DUALBUFF</name>
              <description>Dual Input Buffer</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>INACTIVE</name>
                  <description>AES_IDATARx cannot be written during processing of previous block.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACTIVE</name>
                  <description>AES_IDATARx can be written during processing of previous block when SMOD = 2. It speeds up the overall runtime of large files.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PROCDLY</name>
              <description>Processing Delay</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SMOD</name>
              <description>Start Mode</description>
              <bitOffset>8</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>MANUAL_START</name>
                  <description>Manual Mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUTO_START</name>
                  <description>Auto Mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>IDATAR0_START</name>
                  <description>AES_IDATAR0 access only Auto Mode (DMA)</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>KEYSIZE</name>
              <description>Key Size</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AES128</name>
                  <description>AES Key Size is 128 bits</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES192</name>
                  <description>AES Key Size is 192 bits</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AES256</name>
                  <description>AES Key Size is 256 bits</description>
                  <value>0x2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OPMOD</name>
              <description>Operating Mode</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ECB</name>
                  <description>ECB: Electronic Codebook mode</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CBC</name>
                  <description>CBC: Cipher Block Chaining mode</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>OFB</name>
                  <description>OFB: Output Feedback mode</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CFB</name>
                  <description>CFB: Cipher Feedback mode</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CTR</name>
                  <description>CTR: Counter mode (16-bit internal counter)</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GCM</name>
                  <description>GCM: Galois/Counter mode</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LOD</name>
              <description>Last Output Data Mode</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CFBS</name>
              <description>Cipher Feedback Data Size</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SIZE_128BIT</name>
                  <description>128-bit</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_64BIT</name>
                  <description>64-bit</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_32BIT</name>
                  <description>32-bit</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_16BIT</name>
                  <description>16-bit</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SIZE_8BIT</name>
                  <description>8-bit</description>
                  <value>0x4</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKEY</name>
              <description>Key</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>PASSWD</name>
                  <description>This field must be written with 0xE the first time AES_MR is programmed. For subsequent programming of AES_MR, any value can be written, including that of 0xE.Always reads as 0.</description>
                  <value>0xE</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
        <register>
          <name>IER</name>
          <description>Interrupt Enable Register</description>
          <addressOffset>0x00000010</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready Interrupt Enable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IDR</name>
          <description>Interrupt Disable Register</description>
          <addressOffset>0x00000014</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Disable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready Interrupt Disable</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>IMR</name>
          <description>Interrupt Mask Register</description>
          <addressOffset>0x00000018</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready Interrupt Mask</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Interrupt Mask</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready Interrupt Mask</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>ISR</name>
          <description>Interrupt Status Register</description>
          <addressOffset>0x0000001C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>DATRDY</name>
              <description>Data Ready (cleared by setting bit START or bit SWRST in AES_CR or by reading AES_ODATARx)</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URAD</name>
              <description>Unspecified Register Access Detection Status (cleared by writing SWRST in AES_CR)</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>URAT</name>
              <description>Unspecified Register Access (cleared by writing SWRST in AES_CR)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDR_WR_PROCESSING</name>
                  <description>Input Data register written during the data processing when SMOD = 2 mode.</description>
                  <value>0x0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODR_RD_PROCESSING</name>
                  <description>Output Data register read during the data processing.</description>
                  <value>0x1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MR_WR_PROCESSING</name>
                  <description>Mode register written during the data processing.</description>
                  <value>0x2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ODR_RD_SUBKGEN</name>
                  <description>Output Data register read during the sub-keys generation.</description>
                  <value>0x3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MR_WR_SUBKGEN</name>
                  <description>Mode register written during the sub-keys generation.</description>
                  <value>0x4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>WOR_RD_ACCESS</name>
                  <description>Write-only register read access.</description>
                  <value>0x5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TAGRDY</name>
              <description>GCM Tag Ready</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>KEYWR[%s]</name>
          <description>Key Word Register</description>
          <addressOffset>0x00000020</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>KEYW</name>
              <description>Key Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>IDATAR[%s]</name>
          <description>Input Data Register</description>
          <addressOffset>0x00000040</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IDATA</name>
              <description>Input Data Word</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>ODATAR[%s]</name>
          <description>Output Data Register</description>
          <addressOffset>0x00000050</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>ODATA</name>
              <description>Output Data</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>IVR[%s]</name>
          <description>Initialization Vector Register</description>
          <addressOffset>0x00000060</addressOffset>
          <size>32</size>
          <access>write-only</access>
          <fields>
            <field>
              <name>IV</name>
              <description>Initialization Vector</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AADLENR</name>
          <description>Additional Authenticated Data Length Register</description>
          <addressOffset>0x00000070</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>AADLEN</name>
              <description>Additional Authenticated Data Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLENR</name>
          <description>Plaintext/Ciphertext Length Register</description>
          <addressOffset>0x00000074</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>CLEN</name>
              <description>Plaintext/Ciphertext Length</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>GHASHR[%s]</name>
          <description>GCM Intermediate Hash Word Register</description>
          <addressOffset>0x00000078</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>GHASH</name>
              <description>Intermediate GCM Hash Word x</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>TAGR[%s]</name>
          <description>GCM Authentication Tag Word Register</description>
          <addressOffset>0x00000088</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>TAG</name>
              <description>GCM Authentication Tag x</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CTRR</name>
          <description>GCM Encryption Counter Value Register</description>
          <addressOffset>0x00000098</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <fields>
            <field>
              <name>CTR</name>
              <description>GCM Encryption Counter</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>GCMHR[%s]</name>
          <description>GCM H Word Register</description>
          <addressOffset>0x0000009C</addressOffset>
          <size>32</size>
          <access>read-write</access>
          <fields>
            <field>
              <name>H</name>
              <description>GCM H Word x</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
