chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D42.xml
        <register>
          <name>PMECC3_6</name>
          <description>PMECC Redundancy 3 Register (sec_num = 6)</description>
          <addressOffset>0x0000023C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC4_6</name>
          <description>PMECC Redundancy 4 Register (sec_num = 6)</description>
          <addressOffset>0x00000240</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC5_6</name>
          <description>PMECC Redundancy 5 Register (sec_num = 6)</description>
          <addressOffset>0x00000244</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC6_6</name>
          <description>PMECC Redundancy 6 Register (sec_num = 6)</description>
          <addressOffset>0x00000248</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC7_6</name>
          <description>PMECC Redundancy 7 Register (sec_num = 6)</description>
          <addressOffset>0x0000024C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC8_6</name>
          <description>PMECC Redundancy 8 Register (sec_num = 6)</description>
          <addressOffset>0x00000250</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC9_6</name>
          <description>PMECC Redundancy 9 Register (sec_num = 6)</description>
          <addressOffset>0x00000254</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC10_6</name>
          <description>PMECC Redundancy 10 Register (sec_num = 6)</description>
          <addressOffset>0x00000258</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC0_7</name>
          <description>PMECC Redundancy 0 Register (sec_num = 7)</description>
          <addressOffset>0x00000270</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC1_7</name>
          <description>PMECC Redundancy 1 Register (sec_num = 7)</description>
          <addressOffset>0x00000274</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC2_7</name>
          <description>PMECC Redundancy 2 Register (sec_num = 7)</description>
          <addressOffset>0x00000278</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC3_7</name>
          <description>PMECC Redundancy 3 Register (sec_num = 7)</description>
          <addressOffset>0x0000027C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC4_7</name>
          <description>PMECC Redundancy 4 Register (sec_num = 7)</description>
          <addressOffset>0x00000280</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC5_7</name>
          <description>PMECC Redundancy 5 Register (sec_num = 7)</description>
          <addressOffset>0x00000284</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC6_7</name>
          <description>PMECC Redundancy 6 Register (sec_num = 7)</description>
          <addressOffset>0x00000288</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC7_7</name>
          <description>PMECC Redundancy 7 Register (sec_num = 7)</description>
          <addressOffset>0x0000028C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC8_7</name>
          <description>PMECC Redundancy 8 Register (sec_num = 7)</description>
          <addressOffset>0x00000290</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC9_7</name>
          <description>PMECC Redundancy 9 Register (sec_num = 7)</description>
          <addressOffset>0x00000294</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMECC10_7</name>
          <description>PMECC Redundancy 10 Register (sec_num = 7)</description>
          <addressOffset>0x00000298</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>ECC</name>
              <description>BCH Redundancy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_0</name>
          <description>PMECC Remainder 0 Register (sec_num = 0)</description>
          <addressOffset>0x000002B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_0</name>
          <description>PMECC Remainder 1 Register (sec_num = 0)</description>
          <addressOffset>0x000002B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM2_0</name>
          <description>PMECC Remainder 2 Register (sec_num = 0)</description>
          <addressOffset>0x000002B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_0</name>
          <description>PMECC Remainder 3 Register (sec_num = 0)</description>
          <addressOffset>0x000002BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_0</name>
          <description>PMECC Remainder 4 Register (sec_num = 0)</description>
          <addressOffset>0x000002C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM5_0</name>
          <description>PMECC Remainder 5 Register (sec_num = 0)</description>
          <addressOffset>0x000002C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_0</name>
          <description>PMECC Remainder 6 Register (sec_num = 0)</description>
          <addressOffset>0x000002C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_0</name>
          <description>PMECC Remainder 7 Register (sec_num = 0)</description>
          <addressOffset>0x000002CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM8_0</name>
          <description>PMECC Remainder 8 Register (sec_num = 0)</description>
          <addressOffset>0x000002D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_0</name>
          <description>PMECC Remainder 9 Register (sec_num = 0)</description>
          <addressOffset>0x000002D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_0</name>
          <description>PMECC Remainder 10 Register (sec_num = 0)</description>
          <addressOffset>0x000002D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM11_0</name>
          <description>PMECC Remainder 11 Register (sec_num = 0)</description>
          <addressOffset>0x000002DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_1</name>
          <description>PMECC Remainder 0 Register (sec_num = 1)</description>
          <addressOffset>0x000002F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_1</name>
          <description>PMECC Remainder 1 Register (sec_num = 1)</description>
          <addressOffset>0x000002F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
