chibios-upstream/chibios-tools/tools/embsysregviewdata/data/ARM_Cortex-A5/Atmel/ATSAMA5D42.xml
        <register>
          <name>REM5_3</name>
          <description>PMECC Remainder 5 Register (sec_num = 3)</description>
          <addressOffset>0x00000384</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_3</name>
          <description>PMECC Remainder 6 Register (sec_num = 3)</description>
          <addressOffset>0x00000388</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_3</name>
          <description>PMECC Remainder 7 Register (sec_num = 3)</description>
          <addressOffset>0x0000038C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM8_3</name>
          <description>PMECC Remainder 8 Register (sec_num = 3)</description>
          <addressOffset>0x00000390</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_3</name>
          <description>PMECC Remainder 9 Register (sec_num = 3)</description>
          <addressOffset>0x00000394</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_3</name>
          <description>PMECC Remainder 10 Register (sec_num = 3)</description>
          <addressOffset>0x00000398</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM11_3</name>
          <description>PMECC Remainder 11 Register (sec_num = 3)</description>
          <addressOffset>0x0000039C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_4</name>
          <description>PMECC Remainder 0 Register (sec_num = 4)</description>
          <addressOffset>0x000003B0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_4</name>
          <description>PMECC Remainder 1 Register (sec_num = 4)</description>
          <addressOffset>0x000003B4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM2_4</name>
          <description>PMECC Remainder 2 Register (sec_num = 4)</description>
          <addressOffset>0x000003B8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_4</name>
          <description>PMECC Remainder 3 Register (sec_num = 4)</description>
          <addressOffset>0x000003BC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_4</name>
          <description>PMECC Remainder 4 Register (sec_num = 4)</description>
          <addressOffset>0x000003C0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM5_4</name>
          <description>PMECC Remainder 5 Register (sec_num = 4)</description>
          <addressOffset>0x000003C4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_4</name>
          <description>PMECC Remainder 6 Register (sec_num = 4)</description>
          <addressOffset>0x000003C8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_4</name>
          <description>PMECC Remainder 7 Register (sec_num = 4)</description>
          <addressOffset>0x000003CC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM8_4</name>
          <description>PMECC Remainder 8 Register (sec_num = 4)</description>
          <addressOffset>0x000003D0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM9_4</name>
          <description>PMECC Remainder 9 Register (sec_num = 4)</description>
          <addressOffset>0x000003D4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM10_4</name>
          <description>PMECC Remainder 10 Register (sec_num = 4)</description>
          <addressOffset>0x000003D8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM11_4</name>
          <description>PMECC Remainder 11 Register (sec_num = 4)</description>
          <addressOffset>0x000003DC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM0_5</name>
          <description>PMECC Remainder 0 Register (sec_num = 5)</description>
          <addressOffset>0x000003F0</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM1_5</name>
          <description>PMECC Remainder 1 Register (sec_num = 5)</description>
          <addressOffset>0x000003F4</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM2_5</name>
          <description>PMECC Remainder 2 Register (sec_num = 5)</description>
          <addressOffset>0x000003F8</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM3_5</name>
          <description>PMECC Remainder 3 Register (sec_num = 5)</description>
          <addressOffset>0x000003FC</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM4_5</name>
          <description>PMECC Remainder 4 Register (sec_num = 5)</description>
          <addressOffset>0x00000400</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM5_5</name>
          <description>PMECC Remainder 5 Register (sec_num = 5)</description>
          <addressOffset>0x00000404</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM6_5</name>
          <description>PMECC Remainder 6 Register (sec_num = 5)</description>
          <addressOffset>0x00000408</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>REM7_5</name>
          <description>PMECC Remainder 7 Register (sec_num = 5)</description>
          <addressOffset>0x0000040C</addressOffset>
          <size>32</size>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <fields>
            <field>
              <name>REM2NP1</name>
              <description>BCH Remainder 2 * N + 1</description>
              <bitOffset>0</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>REM2NP3</name>
              <description>BCH Remainder 2 * N + 3</description>
              <bitOffset>16</bitOffset>
              <bitWidth>14</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
